public class Solution{
    public int countDigitOne(int n){
        int ones = 0, m = 1, r = 1;
        while(n > 0){
            ones += (n + 8) / 10 * m + (n % 10 == 1 ? r : 0);
            // 末位数字的规律每到21,31，会额外增加一次"1"
            // n+8就是为了保证每次添加的数字的末位以大于等于"2"结尾
            // 就像3142-3149计算出的ones都是相同的
            // 上面的n%10表示如果末位是"1"，额外添加一次
            r += n % 10 * m;
            // 余数为1，并随着位数的增加，以每轮10倍变大
            m *= 10;
            // 每进一次位，势必会增加一轮"1"，所以系数会乘以10
            n /= 10;
            // 数往高位走
        }
        return ones;
    }
}